c=0
a=0
y=0
x = input("введите номер задания:")

#6.1
def f1():
    c = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин", "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                 "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава", "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево",
                 "Северная Македония": "Скопье", "Сербия": "Белград"}
    print(c)
    a = input("Введите название страны: ")
    print(c[a])
    for key in sorted(c):
        print(key, " - ", c[key])
if x==1:
    f1()

#6,2
def f2():
    c = {"а": 1,
         "б": 3,
         "в": 1,
         "г": 3,
         "д": 2,
         "е": 1,
         "ё": 3,
         "ж": 5,
         "з": 5,
         "и": 1,
         "й": 4,
         "к": 2,
         "л": 2,
         "м": 2,
         "н": 1,
         "о": 1,
         "п": 2,
         "р": 1,
         "с": 1,
         "т": 1,
         "у": 2,
         "ф": 10,
         "х": 5,
         "ц": 5,
         "ч": 5,
         "ш": 8,
         "щ": 10,
         "ъ": 10,
         "ы": 4,
         "ь": 3,
         "э": 8,
         "ю": 8,
         "я": 3}
    a = input("Введите слово:")
    for i in a:
        y += c[i.lower()]
    print("Ваш счет:", y)
if x==2:
    f2()
if x< 0 or x > 2:
    print("Такой задачи нет(")